<!DOCTYPE html>

<head>
    <title>Blogg</title>
    <link rel="stylesheet" href="../style.css">
    <link rel="stylesheet" href="/blogg/static/css/main.css">
    <script src="../scroll.js"></script>
</head>

<body>
    <div class="menu" id="header">
        <ul>
            <li><a href="/">Heim</a></li>
            <li><a href="/blogg">Blogg</a></li>
            <li><a href="/streymi">Streymi</a></li>
            <li><a href="#">Verkefni</a></li>
            <li><a href="#">Ferilskrá</a></li>
        </ul>
    </div>
    <div class="blogg">
        <!-- Page content -->
        <h1 class="content-title">Nýlegar Færslur</h1>
        <div class="banner">
            <a href="register.php">
                <div class="btn">
                    <h3>Nýskráning</h3>
                </div>
            </a>
            <a href="login.php">
                <div class="btn">
                    <h3>Skrá inn</h3>
                </div>
            </a>
        </div>

        <div class="content">
            <div class="single-post">
                <h2>Áttu langt skrúfjárn??</h2>
                <p>Plís getur ehv lagað þetta. Mig vantar bara smá hjálp, ég á ekki nógu langt skrúfjárn til þess að
                    taka hátalarann í sundur. En þú? Þú hlítur að eiga allavega eitt mjög langt skrúfjárn. Ég er að tala
                    um svona 20-30 cm. Ég er með gigg á laugardaginn geturðu plís heyrt í mér fyrir þann tíma. 6660603
                    er númerið mitt, getur líka hringt ef þér líður illa eða bara vantar ehv til að tala við. Fer samt
                    frekar snemma að sofa en mun samt sem áður örugglega svara þér. :)</p>
                <img src="blogg/static/images/PXL_20210518_173756299.jpg">
            </div>
            <div class="single-post">
                <h2>Afhverju eru myndirnar ekki að birtast</h2>
                <p>&Eacute;g h&eacute;lt &eacute;g v&aelig;ri kominn a&eth; r&oacute;t vandans &thorn;egar &eacute;g
                    ramba&eth;i &aacute; rangan directory path &iacute; post scriptinu en neeeeiii. &THORN;essar myndir
                    eru bara ekki a&eth; birtast neinsta&eth;ar. &Eacute;g breytti sm&aacute; k&oacute;&eth;a
                    &aacute;&eth;ur en &eacute;g skrifa&eth;i &thorn;essa f&aelig;rslu en l&iacute;kurnar &aacute;
                    a&eth; &thorn;a&eth; virki eru svo p&iacute;nu ponsu litlar a&eth; &eacute;g mun &eacute;ta
                    sk&oacute;na m&iacute;na ef &thorn;a&eth; gerir &thorn;a&eth;.</p>
                <img src="blogg/static/images/WIN_20210113_16_07_41_Pro.jpg">
            </div>
            <div class="single-post">
                <h2>Jæja...</h2>
                <p>M&eacute;r t&oacute;kst semsagt a&eth; f&aacute; myndirnar til &thorn;ess a&eth; virka. &THORN;etta
                    var &thorn;a&eth; sem &eacute;g h&eacute;lt, &eacute;g var a&eth; vista &thorn;&aelig;r &aacute;
                    kolr&ouml;ngum sta&eth; en samt a&eth; reyna a&eth; s&aelig;kja &thorn;&aelig;r &aacute;
                    r&eacute;ttann sta&eth;. &THORN;a&eth; vonda vi&eth; a&eth; laga &thorn;etta er samt a&eth;
                    s&iacute;&eth;asta f&aelig;rsla l&aelig;tur mig l&iacute;ta &uacute;t fyrir a&eth; vera allt of
                    pirra&eth;an fyrir svona l&iacute;ti&eth; vandam&aacute;l og svo &thorn;arf &eacute;g
                    n&aacute;tt&uacute;rulega l&iacute;ka a&eth; &eacute;ta sk&oacute;inn minn en &thorn;a&eth; var
                    kominn t&iacute;mi &aacute; &thorn;a&eth; hvort sem er.</p>
                <img src="blogg/static/images/PXL_20210526_144959558.jpg">
            </div>
            <div class="single-post">
                <h2>Tannpína? Vonandi ekki :/</h2>
                <p>Af og til s&iacute;&eth;ustu m&aacute;nu&eth;i hef &eacute;g fundi&eth; fyrir miklum s&aacute;rsauka
                    &iacute; vinstri kj&aacute;lkanum. &Eacute;g hef aldrei veri&eth; me&eth; tannp&iacute;nu og
                    &eacute;g held a&eth; tannp&iacute;na s&eacute; verri s&aacute;rsauki en s&aacute; sem &eacute;g
                    finn af og til. EN. &Eacute;g hef heldur ekki fari&eth; til tannl&aelig;knis &iacute; r&uacute;mlega
                    tv&ouml; &aacute;r. &THORN;a&eth; er bara svo d&yacute;rt :(</p>
                <img src="blogg/static/images/MAC0496.jpg">
            </div>
            <div class="single-post">
                <h2>Hlutir sem væru skemmtilegri #1</h2>
                <ul>
                    <li>Heimurinn ef a&eth; b&ouml;rn fengju a&eth; kj&oacute;sa</li>
                    <li>Helgar ef &thorn;&aelig;r v&aelig;ru &thorn;r&iacute;r dagar &iacute; sta&eth;inn fyrir tvo</li>
                    <li>B&iacute;lar ef &thorn;eir v&aelig;ru bara a&eth;eins minni, &thorn;a&eth; v&aelig;ri frekar
                        fyndi&eth;</li>
                    <li>Ef sm&aacute;b&ouml;rn &thorn;yrftu a&eth; passa upp &aacute; foreldra s&iacute;na en ekki
                        &ouml;fugt. td. barn a&eth; &yacute;ta m&ouml;mmu sinni &iacute; r&oacute;lu (mj&ouml;g
                        skemmtilegt)</li>
                    <li>Peysur, nema ma&eth;ur f&aelig;ri &iacute; &thorn;&aelig;r &iacute; gegn um f&aelig;turna</li>
                    <li>Drykkjaf&ouml;ng sem v&aelig;ru &uacute;thverf, veit ekki hvernig</li>
                    <li>Listaverk sem m&aelig;tti snerta, &thorn;&aacute; &ouml;ll listaverk ekki bara sum</li>
                    <li>G&ouml;tur og gangst&eacute;ttir ef &thorn;&aelig;r v&aelig;ru hoppukastalar. Ma&eth;ur
                        v&aelig;ri svo flj&oacute;tur e&eth;a svo lengi a&eth; fara allt</li>
                </ul>
                <img src="blogg/static/images/baby.jpg">
            </div>

        </div>
    </div>

    <h1 id="footer"><a href="/" style="color: black; text-decoration: none;">SJOMLI.IS</a></h1>
</body>

</html>